#include <iostream> 
using namespace std;

//Руда Єлизавета Варіант 27

int main()
{
    setlocale(0, ".1251");
    //Дано
    int const n = 10;
    double mas[n] = { 0.52, 1, 86, 60.9, -18.3, 10, 1.123, 79, -21.23, -406 };
    cout << "Дано одиничний масив mas[n] = { 0.52, 1, 86, 60.9, -18.3, 10, 1.123, 79, -21.23, -406 }" << endl <<endl;

    // Пошук максимального числа в масиві
    double max_el = 0;
    for (int o = 0; o < 9; o++)
    {
        if (mas[o] > max_el)
            max_el = mas[o];
    }
    cout << "Максимальне число в масиві = " << max_el <<endl;


    // Пошук індекса останнього додатнього числа
    int last_positive = n - 1;
    // Шукаємо з кінця поки число від'ємне
    while (last_positive != -1 && mas[last_positive] <= 0)
    {
        --last_positive;
    }

    //Рахуємо суму елементів масиву, розташованих до останнього додатного елемента, якщо воно взагалі є
    if (last_positive == -1)
    {
        cout << "В масиві відсутні додатні числа" << endl;
    }
    else
    {
        double sum = 0;
        for (int i = 0; i < last_positive; i++)//шукаємо від першого ел. масиву до останнього додатнього
            sum += mas[i]; 
        cout << "Сума елементів масиву, розташованих до останнього додатного елемента = " << sum << endl;
    }

    //Задаємо ітервал чисел, які видалимо з масиву
    double a, b;
    cout << "Введіть інтервал чисел, які ви хочете видалити з масиву" << endl;
    cin >> a >> b;
    cout << "Ви задали інтервал [ " << a << " , " << b << " ]" << endl;
    
    //Перевіряємо чи коректно задано число
    while (a > b)
    {
       cout << "Введено некоректний інтервал, a > b! Спробуйте ще раз. " << endl;
       cin >> a >> b;
    }

        
    int i = 0, k = 0; 
    while (i < n - k)
    {
        //Перевіряємо чи входить елемент в інтервал [a; b]
        if (abs(mas[i]) >= a && abs(mas[i]) <= b)
            {
                //Зсуваємо усі елементи від цього вліво, тим самим видаливши це число
                for (int j = i; j < n - k - 1; j++)
                    mas[j] = mas[j + 1];
                ++k; //Збільшуємо к-ть видалених чисел
            }
        else
        ++i; //Перевіряємо наступне число. і - номер елемета в масиві
    }

    //В кінці ставимо k нулів. Тобто стільки нулів, скільки ми видалили чисел
    for (i = n - 1; k != 0; mas[i] = 0, k--, i--);
    //Виводимо змінений кінцевий масив
    cout << "Стиснутий масив: " << endl;
    for (int i = 0; i < n; i++)
    cout << mas[i] << ' ';
    cout << endl;

    return 0;
}

